{
  "header": {
    "name": "Grzegorz Kozub",
    "title": "Senior Software Engineer",
    "kaizen": "改善",
    "location": "Warsaw, Poland",
    "email": "grzegorz.kozub@gmail.com",
    "web": "http://www.linkedin.com/in/grzegorzkozub",
    "headline": "Developer and architect. Generalist exploring Domain-Driven Design, Clean Architecture and Microservices. Inspired by DevOps culture, leads Product Teams to design, integrate and deploy small increments frequently to production."
  },
  "skills": [
    {
      "category": "Arch",
      "tags": [
        "CQRS",
        "Domain-Driven Design",
        "Hexagonal (Ports and Adapters)",
        "Messaging",
        "Microservices",
        "REST"
      ]
    },
    {
      "category": "Ops",
      "tags": [
        "Azure",
        "Azure DevOps",
        "docker",
        "git",
        "IIS",
        "kubernetes (learning)",
        "Linux",
        "PowerShell",
        "Trunk-Based Development",
        "Windows"
      ]
    },
    {
      "category": "Dev",
      "tags": [
        ".Net",
        "Angular",
        "C#",
        "Go (learning)",
        "JavaScript",
        "Node.js",
        "React (learning)",
        "SQL Server",
        "TypeScript"
      ]
    }
  ],
  "recentJob": {
    "company": {
      "name": "Ivanti",
      "profile": "Ivanti offers solutions for IT asset and service management, identity and endpoint management, supply chain and security. Ivanti Cloud provides a centralized overview and management of an organization inventory as well as optimization and problem solving advice."
    },
    "titles": [
      {
        "name": "Developer, Architect, Tech Lead",
        "time": "Since November 2017",
        "roles": [
          "My first goal was to lead my team to take the ownership of License Optimizer, a legacy product for establishing specific vendor software license position for our customers that is a SaaS offering written in .Net and deployed as monolith. While learning about the domain, we identified the architecture as well as the technical debts we had tackled immediately.",
          "Most importantly, we added database sharding and replication, removed manual tests in favour of automated test suite, created the deployment pipeline up to production including database migrations. All that while adding value for the customers by making changes and fixing bugs.",
          "As a result, License Optimizer is now scalable and ready to accept customers from different regions. Product Team can integrate changes quicker and without significant risk of introducing bugs. Quarterly, manual release with 1 hour downtime became weekly, automated deployment with 5 minutes of unavailability.",
          "Moving forward with License Optimizer adoption, we got a chance to integrate it with Ivanti Cloud. First, we tackled tenant management automation. Then we identified and started extracting some Bounded Contexts from legacy monolith to Ivanti Cloud.",
          "Following the scalability drivers, on deployment level we based our microservices on Service Fabric and communicated them asynchronously with events. Inside the components we opted for Ports and Adapters which decoupled the domain logic from the infrastructure code. We also put considerable effort on Integration Tests harness.",
          "As a result, different License Optimizer capabilities are ready to continue their migration to Ivanti Cloud to make the product more scalable and flexible in regards to offering.",
          "I am very happy that we attempted to grow the product following the ways described in the book Inspired by Marty Cagan, that is by using different Product Discovery techniques involving our customers."
        ]
      }
    ]
  },
  "pastJobs": [
    {
      "company": {
        "name": "Apsis International AB"
      },
      "titles": [
        {
          "name": "Developer, Architect, Tech Lead, Team Leader",
          "time": "July 2015 - September 2016 (1 year 3 months)",
          "roles": [
            "Design architecture changes for Apsis Pro, a SaaS email marketing product",
            "Modernize the public REST API",
            "Improve performance of the high volume mailing list import solution and CRM integration",
            "Contribute to .Net and AngularJS codebase",
            "Co-author the Release Process for small and frequent deployments and take the Release Manager role",
            "Co-design and take part in the On-Call Process",
            "Maintain and grow the infrastructure",
            "Give programming, architecture and infrastructure guidance",
            "With utmost pleasure, lead a team of 5 great developers in Warsaw"
          ]
        },
        {
          "name": "Developer",
          "time": "September 2012 - June 2015 (2 year 10 months)",
          "roles": [
            "Fix bugs in Apsis Pro, a SaaS email marketing product",
            "Contribute to the codebase of builders for rendering and sending emails, high volume mailing list importers and public REST API",
            "Develop the in-house deployment pipeline using Ruby and PowerShell"
          ]
        }
      ]
    },
    {
      "company": {
        "name": "Hewlett Packard Enterprise"
      },
      "titles": [
        {
          "name": "Developer, Tech Lead",
          "time": "January 2010 - August 2012 (2 years 8 months)",
          "roles": [
            "Develop desktop apps, web apps and APIs in .Net for public administration",
            "Give technical guidance"
          ]
        },
        {
          "name": "Developer",
          "time": "March 2009 - December 2009 (10 months)",
          "roles": [
            "Fix bugs in a banking web app with JavaScript front-end and back-end",
            "Design and implement reports with UNIX Shell and PL/SQL"
          ]
        }
      ]
    },
    {
      "company": {
        "name": "Electronic Data Systems"
      },
      "titles": [
        {
          "name": "Programmer",
          "time": "September 2006 - November 2008 (2 years 3 months)",
          "roles": [
            "Design Defect and Release Management for a banking system",
            "Automate reporting in Excel using Visual Basic"
          ]
        },
        {
          "name": "Programmer",
          "time": "June 2006 - August 2006 (3 months)",
          "roles": [
            "Process data using Digital Workflow, an ITIL-based Asset and Problem Management product"
          ]
        },
        {
          "name": "Tester",
          "time": "October 2004 - May 2006 (1 year 8 months)",
          "roles": [
            "Design integration testing for a telecom system migration"
          ]
        }
      ]
    }
  ],
  "notableProjects": [
    {
      "company": {
        "name": "Apsis International AB"
      },
      "projects": [
        {
          "name": "Event module for Apsis Pro",
          "time": "March 2016",
          "summary": "An interesting project we worked on for Apsis was about re-architecturing and enriching the existing Event module. The functionality allows for managing sessions, sending invites and reminders via email and SMS, tracking registrations (with seat booking) and attendance and finally gathering feedback. This was one of the first modules of Apsis Pro designed using Domain-Driven Design. We put it together as a SPA with AngularJS and ASP.Net Web API supported by some background processing apps. Notably, a set of public APIs was included that supported registering and managing attendees."
        },
        {
          "name": "Updates to Apsis Pro Integrations",
          "time": "August 2016",
          "summary": "Since Apsis is constantly growing it turned out our existing public API, high volume subscription importers and push integration needed a boost in performance. Interestingly, importers and push are expected to work with data from one to a couple million subscribers. We've done load testing and improving API and importer throughput. We also have rewritten the push integration as a horizontally scalable app based on NServiceBus backed by MSMQ queues."
        }
      ]
    },
    {
      "company": {
        "name": "Hewlett Packard Enterprise"
      },
      "projects": [
        {
          "name": "Driver Candidate Profile",
          "time": "August 2012",
          "summary": "This SOAP web service system is used for processing driver candidate data from inception, when a person registers for a driving school, through training and exams to the point when such candidate profile actually becomes input data for a driver's licence doc. We were tasked with designing the XSD schema that supported growing driver candidate history and implementing web services that allow 3rd party to integrate so that the document flow that was once done on paper via post office is now automated over the wire. We gained experience in Windows Communication Foundation and Client Certificates."
        },
        {
          "name": "Vehicle and Driver System",
          "time": "August 2011",
          "summary": "For our public administration client in Poland we've been adding changes and fixing defects in the system used on clerk desktops to process vehicle registration and driver's license docs. It's a distributed Windows Forms (.Net) rich client deployed on a couple hundred departments connecting to one of the few regional SQL Server database instances. Notably, we used Composite UI Application Block together with the Unit of Work pattern. We also automated the deployment to those desktops with Windows batch scripts and the regional partitioning allowed for Canary Releases."
        }
      ]
    }
  ],
  "education": [
    {
      "school": "University of Silesia",
      "studies": [
        {
          "faculty": "Faculty of Computer Science and Material Studies",
          "major": "Computer Science, Master's studies",
          "time": "September 2002 - June 2004 (2 years)"
        },
        {
          "faculty": "Faculty of Technology",
          "major": "Computer Science, Bachelor's studies",
          "time": "September 1999 - June 2002 (3 years)"
        }
      ]
    },
    {
      "school": "Technical College of the Jaworzno III Power Plant",
      "studies": [
        {
          "faculty": "Computer Systems",
          "major": "Electronic Technician",
          "time": "September 1994 - June 1999 (5 years)"
        }
      ]
    }
  ]
}
